:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
:: UNIV_DEVELOPER		      ::
:: GameServer StartBatchFile	      ::
:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
::
::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::사 용 법::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
::GameServerLibrary.exe ::밑으로 순서와 포맷에 맞춰서 입력해 주세요::
::★모든 개행 및 띄워쓰기 단위는 xor(shift + 6) 연산자입니다.★	::
::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::EXAMPLE::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::* 대신에 xor(shift + 6) 연산자로 적으세요:::::::::::::::::::::::::::::::::
::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
::Using Port *		10435 *
::BackLogQueueSize *	SOMAXCONN *
::Worker Thread Count *	n *
::Running Thread Count *	0<r<n *
::Nagle Off Flag *		1 or 0 *
::Max Session Count *	N *
::Time Out Timer *		T *
::
::Chatting Server Frame *	Frame *
::Login Server Frame *	Frame *
::Game Server Frame *	Frame *
:: PORT *
:: LOGIN SERVER *		10435 *
:: CHATTING SERVER * 	10445 *
:: GAME SERVER *		10455 *
::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
::
::::::::::::::::::::::::::::::
::Config Start ::
::::::::::::::::::::::::::::::
GameServerLibrary.exe ^
			----------------------------------------------------------------^
			___NET_SERVER_CONFIG___^
			----------------------------------------------------------------^
			NET_SERVER_LISTEN_PORT^			10445^
			NET_SERVER_BACKLOGQUEUE^		1000^
			NET_SERVER_WORKER_THREAD^		4^
			NET_SERVER_RUNNING_THREAD^		4^
			NET_SERVER_NAGLE_OFF^			0^
			NET_SERVER_MAX_SESSION_COUNT^		20000^
			NET_SERVER_TIME_OUT_CLOCK^		30000^
			----------------------------------------------------------------^
			___LOGIN_SERVER_CONFIG___^
			LOGIN_ATTACH_FLAG^			0^
			LOGIN_BLOCK_FRAME^			1^
			----------------------------------------------------------------^
			___GAME_SERVER_CONFIG___^
			GAME_ATTACH_FLAG^			0^
			GAME_BLOCK_FRAME^			30^
			----------------------------------------------------------------^
			___CHATTING_SERVER_CONFIG___ ^
			CHATTING_ATTACH_FLAG^			1^
			CHATTING_BLOCK_FRAME^			1^
			----------------------------------------------------------------^